#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.branch_protection_api_gateway will be created
  + resource "github_branch_protection" "branch_protection_api_gateway" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "ApiGateway"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection_conference_session_service will be created
  + resource "github_branch_protection" "branch_protection_conference_session_service" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "ConferenceSessionService"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection_feed_service will be created
  + resource "github_branch_protection" "branch_protection_feed_service" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "FeedService"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection_session_service will be created
  + resource "github_branch_protection" "branch_protection_session_service" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "SessionService"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = false
        }
    }

  # github_repository.repository_api_gateway will be created
  + resource "github_repository" "repository_api_gateway" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Microservice for aggregating requests to storage services"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "ApiGateway"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.repository_conference_session_service will be created
  + resource "github_repository" "repository_conference_session_service" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Microservice for storing the relationship between conferences and sessions"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "ConferenceSessionService"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.repository_feed_service will be created
  + resource "github_repository" "repository_feed_service" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Microservice for storing conference feeds"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "FeedService"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.repository_session_service will be created
  + resource "github_repository" "repository_session_service" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Microservice for storing conference sessions"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "SessionService"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
